eisup_2019_docmng_integration/src/DataProcessors/внНастройкаЖурналаРегистрации/внНастройкаЖурналаРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>внНастройкаЖурналаРегистрации</name>
</mdclass:DataProcessor>

eisup_2019_docmng_integration/src/InformationRegisters/внНеРегистрируемыеОбъекты/внНеРегистрируемыеОбъекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>внНеРегистрируемыеОбъекты</name>
  <comment>// Объекты регистрацию которых осуществлять не нужно</comment>
  <resources>
    <name>НеРегистрировать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>МетаданныеОбъекта</name>
    <comment>// метаданные объекта строкой</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяТЧ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРеквизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/внТипОбменаРИБ/внТипОбменаРИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>внТипОбменаРИБ</name>
  <enumValues>
    <name>ОбменЧерезРИБХранительЖурнала</name>
  </enumValues>
  <enumValues>
    <name>ОбменКэшемЖурналаЧерезТиповойРИБ</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/внТипИБ/внТипИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>внТипИБ</name>
  <enumValues>
    <name>Серверная</name>
  </enumValues>
  <enumValues>
    <name>Файловая</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Catalogs/ИдентификаторыОбъектовМетаданных/ИдентификаторыОбъектовМетаданных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИдентификаторыОбъектовМетаданных</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>РегистрСведенийНастройкиВариантовОтчетов</name>
    </items>
    <items>
      <name>РегистрСведенийДанныеБизнесПроцессов</name>
    </items>
    <items>
      <name>РегистрСведенийДополнительныеСведения</name>
    </items>
    <items>
      <name>РегистрСведенийИсполнителиЗадач</name>
    </items>
    <items>
      <name>РегистрСведенийНапоминанияПользователя</name>
    </items>
    <items>
      <name>РегистрСведенийНастройкиУчетныхЗаписейЭлектроннойПочты</name>
    </items>
    <items>
      <name>РегистрСведенийПредметыПапкиВзаимодействий</name>
    </items>
  </predefined>
  <attributes>
    <name>ПорядокКоллекции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <comment>Например, &quot;ОбъектыАдресацииЗадач&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеИмя</name>
    <comment>Например, &quot;ПланВидовХарактеристик.ОбъектыАдресацииЗадач&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>430</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолныйСиноним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>430</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БезДанных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеПустойСсылки</name>
    <type>
      <types>ExchangePlanRef</types>
      <types>BusinessProcessRef</types>
      <types>DocumentRef</types>
      <types>ChartOfCalculationTypesRef</types>
      <types>TaskRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>ChartOfAccountsRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючОбъектаМетаданных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НоваяСсылка</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </attributes>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/DataProcessors/внНастройкаЖурналаРегистрации/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ

//
// Процедура выполняет обновление информационной базы в случае необходимости.
//
Процедура ВыполнитьОбновление() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ТекущаяВерсия	= внЖурналРегистрацииПовтИсп.глВНЗначениеПеременной("Версия");
	ПоследняяВерсия = "3.0.5.0";
	
	Если ТекущаяВерсия = ПоследняяВерсия Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ТекущаяВерсия) Тогда
		
		// Это первый запуск
		ЗаполнитьПервоначальнымиДанными();
		
	Иначе
		
		Если ТекущаяВерсия = "3.0.2.3" Тогда
			ОбновитьДоВерсии_3_0_5();
		КонецЕсли;
		
		Сообщить("Подсистема <Журнал регистрации изменений во внешней ИБ 1С> обновлена на версию " + ПоследняяВерсия);
		
	КонецЕсли;
	
	// Если БСП обновим идентификаторы
	Попытка
		Если Метаданные.Справочники.Найти("ИдентификаторыОбъектовМетаданных") <> Неопределено Тогда
			Выполнить("Справочники.ИдентификаторыОбъектовМетаданных.ОбновитьДанныеСправочника()");
		КонецЕсли;
	Исключение		
	КонецПопытки;
	
	внЖурналРегистрацииСервер.УстановитьНастройкуЖурналаРегистрации("Версия", ПоследняяВерсия);
	ОбновитьПовторноИспользуемыеЗначения();
		
КонецПроцедуры

Процедура ЗаполнитьПервоначальнымиДанными() Экспорт
	
	// Удаляем регистры из регистрируемых объектов
	НаборЗаписей = РегистрыСведений.внНеРегистрируемыеОбъекты.СоздатьНаборЗаписей();
	Для каждого Регистр Из Метаданные.РегистрыСведений Цикл
		НоваяЗапись						= НаборЗаписей.Добавить();
		НоваяЗапись.МетаданныеОбъекта	= Регистр.ПолноеИмя();
		НоваяЗапись.ИмяТЧ				= "";
		НоваяЗапись.ИмяРеквизита		= "";
		НоваяЗапись.НеРегистрировать	= Истина;
	КонецЦикла;
	НаборЗаписей.Записать(Истина);
	
	внЖурналРегистрацииСервер.УстановитьНастройкуЖурналаРегистрации("ИспользоватьПараметрУникальностиИБ",	Истина);
	Параметры																								= внЖурналРегистрации.ПараметрУникальностиИБ();
	внЖурналРегистрацииСервер.УстановитьНастройкуЖурналаРегистрации("ПараметрУникальностиСписокСерверов",	Параметры.Сервер);
	внЖурналРегистрацииСервер.УстановитьНастройкуЖурналаРегистрации("ПараметрУникальностиИмяБазы",			Параметры.ИмяБазы);
	внЖурналРегистрацииСервер.УстановитьНастройкуЖурналаРегистрации("ИдентификаторИБ",						Метаданные.Имя);
	внЖурналРегистрацииСервер.УстановитьНастройкуЖурналаРегистрации("ТипОбменаРИБ",							Перечисления.внТипОбменаРИБ.ОбменЧерезРИБХранительЖурнала);
	внЖурналРегистрацииСервер.УстановитьНастройкуЖурналаРегистрации("ТипИБ",								Перечисления.внТипИБ.Серверная);
	внЖурналРегистрацииСервер.УстановитьНастройкуЖурналаРегистрации("ОткрыватьСобытияСФильтромИзменений",	Истина);
	внЖурналРегистрацииСервер.УстановитьНастройкуЖурналаРегистрации("РазмерПакетаПереносаДанных",			100);
	внЖурналРегистрацииСервер.УстановитьНастройкуЖурналаРегистрации("ДавностьПросмотраВЖурналеПоУмолчанию",	2);
	
КонецПроцедуры

Процедура ОбновитьДоВерсии_3_0_5() Экспорт
	
	внЖурналРегистрацииСервер.УстановитьНастройкуЖурналаРегистрации("РазмерПакетаПереносаДанных",			100);
	
КонецПроцедуры
